app/Controllers/AdminController.php

SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'admin'
SELECT COUNT(*) AS `numrows`
FROM `expenses`
SELECT COUNT(*) AS `numrows`
FROM (
SELECT `category`
FROM `expenses`
GROUP BY `category`
) CI_count_all_results
---
  public function dashboard()
  {
    $userModel = new \App\Models\UserModel();
    $expenseModel = new \App\Models\ExpenseModel();

    $data['totalUsers'] = $userModel->countAllResults();

    $data['totalAdmins'] = $userModel
      ->where('role', 'admin')
      ->countAllResults();

    $data['totalExpenses'] = $expenseModel->countAllResults();

    $data['totalCategories'] = $expenseModel
      ->select('category')
      ->groupBy('category')
      ->countAllResults();