app/Controllers/AuthController.php

  public function loginProcess()
  {
    $throttler = service('throttler');
    if ($throttler->check(md5($this->request->getIPAddress()), 5, MINUTE) === false) {
      return redirect()->to('/login')->with('error', 'Too many login attempts. Please wait a minute and try again.');
    }

    $model = new UserModel();
    $email = trim($this->request->getPost('email'));
    $password = trim($this->request->getPost('password'));

    $user = $model->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'oliverfiesta30@gmail.com'
 LIMIT 1

  private function sendOtpToUser($userId, $email)
  {
    $otpModel = new \App\Models\OtpModel();

    $code = (string) random_int(100000, 999999);

    $otpModel->insert([
      'user_id'    => $userId,
      'otp_code'   => $code,
      'expires_at' => date('Y-m-d H:i:s', strtotime('+5 minutes')),
      'created_at' => date('Y-m-d H:i:s'),
    ]);
---
INSERT INTO `otps` (`user_id`, `otp_code`, `expires_at`, `created_at`) VALUES ('14', '705142', '2026-07-18 18:07:58', '2026-07-18 18:02:58')

  public function verifyOtp()
  {
    $userId = session()->get('pending_user_id');
    if (!$userId) {
      return redirect()->to('/login');
    }

    $otpModel = new \App\Models\OtpModel();
    $submittedCode = trim($this->request->getPost('otp_code'));

    $latestOtp = $otpModel->where('user_id', $userId)
      ->orderBy('id', 'DESC')
      ->first();

    if (!$latestOtp || $latestOtp['otp_code'] !== $submittedCode) {
      return redirect()->to('/verify')->with('error', 'Invalid code. Please try again.');
    }

    if (strtotime($latestOtp['expires_at']) < time()) {
      return redirect()->to('/verify')->with('error', 'Code expired. Please request a new one.');
    }

    $userModel = new UserModel();
    $userModel->update($userId, ['is_verified' => 1]);

    $user = $userModel->find($userId);
---
SELECT *
FROM `otps`
WHERE `user_id` = '14'
ORDER BY `id` DESC
 LIMIT 1
UPDATE `users` SET `is_verified` = 1, `updated_at` = '2026-07-18 18:02:39'
WHERE `users`.`id` IN ('14')
SELECT *
FROM `users`
WHERE `users`.`id` = '14'

  public function verifyShow()
  {
    $userId = session()->get('pending_user_id');
    if (!$userId) {
      return redirect()->to('/login');
    }

    $userModel = new UserModel();
    $user = $userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '14'