app/Controllers/DashboardController.php

  public function index()
  {
    $userId = session()->get('user_id');

    // Total Expenses
    $totalExpenses = (new ExpenseModel())
      ->selectSum('amount')
      ->where('user_id', $userId)
      ->first();

    // This Month
    $thisMonth = (new ExpenseModel())
      ->selectSum('amount')
      ->where('user_id', $userId)
      ->where('MONTH(expense_date)', date('m'))
      ->where('YEAR(expense_date)', date('Y'))
      ->first();

    // Top Category
    $topCategory = (new ExpenseModel())
      ->select('category, COUNT(*) as total')
      ->where('user_id', $userId)
      ->groupBy('category')
      ->orderBy('total', 'DESC')
      ->first();

    // Total Records
    $totalRecords = (new ExpenseModel())
      ->where('user_id', $userId)
      ->countAllResults();
---
SELECT SUM(`amount`) AS `amount`
FROM `expenses`
WHERE `user_id` = '14'
 LIMIT 1
SELECT SUM(`amount`) AS `amount`
FROM `expenses`
WHERE `user_id` = '14'
AND MONTH(expense_date) = '07'
AND YEAR(expense_date) = '2026'
 LIMIT 1
SELECT `category`, COUNT(*) as total
FROM `expenses`
WHERE `user_id` = '14'
GROUP BY `category`
ORDER BY `total` DESC
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `expenses`
WHERE `user_id` = '14'

    // ---- CHART DATA ----

    // Monthly Expenses (Area Chart)
    $monthlyExpenses = (new ExpenseModel())
      ->select('MONTH(expense_date) as month, SUM(amount) as total')
      ->where('user_id', $userId)
      ->where('YEAR(expense_date)', date('Y'))
      ->groupBy('MONTH(expense_date)')
      ->orderBy('MONTH(expense_date)', 'ASC')
      ->findAll();
---
SELECT MONTH(expense_date) as month, SUM(amount) as total
FROM `expenses`
WHERE `user_id` = '14'
AND YEAR(expense_date) = '2026'
GROUP BY MONTH(expense_date)
ORDER BY MONTH(expense_date) ASC

    }

    // Category Expenses (Pie Chart)
    $categoryExpenses = (new ExpenseModel())
      ->select('category, SUM(amount) as total')
      ->where('user_id', $userId)
      ->groupBy('category')
      ->findAll();
---
SELECT `category`, SUM(amount) as total
FROM `expenses`
WHERE `user_id` = '14'
GROUP BY `category`