app/Controllers/ExpenseController.php

SELECT *
FROM `expenses`
ORDER BY `expense_date` DESC
SELECT *
FROM `expenses`
WHERE `user_id` = '14'
ORDER BY `expense_date` DESC
 LIMIT 1
SELECT *
FROM `expenses`
WHERE `user_id` = '14'
ORDER BY `amount` DESC
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `expenses`
WHERE `user_id` = '14'
SELECT `category`, COUNT(*) as total
FROM `expenses`
WHERE `user_id` = '14'
GROUP BY `category`
ORDER BY `total` DESC
 LIMIT 1
---
  public function index()
  {
    $model = new ExpenseModel();
    $userId = session()->get('user_id');
    $isAdmin = session()->get('role') === 'admin';

    if ($isAdmin) {
      $data['expenses'] = $model
        ->orderBy('expense_date', 'DESC')
        ->findAll();
    } else {
      $data['expenses'] = $model
        ->where('user_id', $userId)
        ->orderBy('expense_date', 'DESC')
        ->findAll();
    }

    // Latest expense amount
    $latest = $model
      ->where('user_id', $userId)
      ->orderBy('expense_date', 'DESC')
      ->first();
    $data['latestAmount'] = $latest['amount'] ?? 0;

    // Highest single expense
    $highest = $model
      ->where('user_id', $userId)
      ->orderBy('amount', 'DESC')
      ->first();
    $data['highestExpense'] = $highest['amount'] ?? 0;

    // Top Category
    $data['topCategory'] = (new ExpenseModel())
      ->select('category, COUNT(*) as total')
      ->where('user_id', $userId)
      ->groupBy('category')
      ->orderBy('total', 'DESC')
      ->first()['category'] ?? 'None';