app/Controllers/ReportController.php

  public function index()
  {
    $model = new ExpenseModel();
    $userId = session()->get('user_id');

    // Total Expenses
    $totalExpenses = $model
      ->selectSum('amount')
      ->where('user_id', $userId)
      ->first();

    // This Month
    $thisMonth = $model
      ->selectSum('amount')
      ->where('user_id', $userId)
      ->where('MONTH(expense_date)', date('m'))
      ->where('YEAR(expense_date)', date('Y'))
      ->first();

    // Top Category
    $topCategory = (new ExpenseModel())
      ->select('category, COUNT(*) as total')
      ->where('user_id', $userId)
      ->groupBy('category')
      ->orderBy('total', 'DESC')
      ->first();

    // Total Records
    $totalRecords = $model
      ->where('user_id', $userId)
      ->countAllResults();
---
SELECT SUM(`amount`) AS `amount`
FROM `expenses`
WHERE `user_id` = '15'
 LIMIT 1
SELECT SUM(`amount`) AS `amount`
FROM `expenses`
WHERE `user_id` = '15'
AND MONTH(expense_date) = '07'
AND YEAR(expense_date) = '2026'
 LIMIT 1
SELECT `category`, COUNT(*) as total
FROM `expenses`
WHERE `user_id` = '15'
GROUP BY `category`
ORDER BY `total` DESC
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `expenses`
WHERE `user_id` = '15'